In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [4]:
clientes = pd.read_csv('../files/datos/clientes.csv', sep=',', encoding='utf8')
print(clientes)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [6]:
print(clientes['nombre'])

0       Juan
1      Luisa
2        NaN
3     Carmen
4        NaN
5      Mario
6      Pedro
7    Gustavo
8     Carlos
Name: nombre, dtype: object

In [8]:
print(clientes['nombre'].isnull())

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8    False
Name: nombre, dtype: bool

In [14]:
clientes[clientes['nombre'].isnull()]

  nombre  edad  ingreso
2    NaN  70.0  20000.0
4    NaN   NaN      NaN

In [15]:
clientes.dropna()

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0

In [17]:
clientes_limpios = clientes.dropna(subset=['nombre', 'ingreso'])

In [18]:
clientes_limpios

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0
6   Pedro   NaN  17400.0

In [19]:
clientes

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [24]:
print(clientes.fillna(0))

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2        0  70.0  20000.0
3   Carmen  49.0  22000.0
4        0   0.0      0.0
5    Mario  30.0  15800.0
6    Pedro   0.0  17400.0
7  Gustavo  27.0      0.0
8   Carlos   0.0      0.0

In [25]:
print(clientes['nombre'].fillna('Unconue'))

0       Juan
1      Luisa
2    Unconue
3     Carmen
4    Unconue
5      Mario
6      Pedro
7    Gustavo
8     Carlos
Name: nombre, dtype: object

In [34]:
valores = {'nombre': 'Anónimo', 
           'edad': int(np.mean(clientes['edad'])), 
           'ingreso': np.mean(clientes['ingreso'])}

In [35]:
clientes.fillna(value=valores)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2  Anónimo  70.0  20000.0
3   Carmen  49.0  22000.0
4  Anónimo  39.0  18000.0
5    Mario  30.0  15800.0
6    Pedro  39.0  17400.0
7  Gustavo  27.0  18000.0
8   Carlos  39.0  18000.0

In [40]:
promedio_i = clientes['ingreso'].mean()
mediana_i = clientes['ingreso'].median()
moda_i = clientes['ingreso'].mode()[0]

print(promedio_i, mediana_i, moda_i)

18000.0 17200.0 15800.0

In [41]:
clientes

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [43]:
clientes['ingreso'] = clientes['ingreso'].fillna(moda_i)

In [44]:
clientes

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN  15800.0
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0  15800.0
8   Carlos   NaN  15800.0